{
  "workHistory": [
    {
      "title": "Lead Software Engineer",
      "company": "DST Systems",
      "startDate": "January 2018",
      "endDate": "",
      "description": "Research and Development",
      "bullets": [
        "Lead development on multiple application using (MIC) high-school interns, college interns, and entry level employees.",
        "Coordinated the deployment of Openshift on aws and the setup of Eclipse Che (as a starter IDE).",
        "Developed the companies first inner-sourced products."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": "DST Systems",
      "startDate": "January 2017",
      "endDate": "January 2018",
      "description": "Development",
      "bullets": [
        "Lead a small team to develop two enterprise applications using a four-tier architecture (data platform and CICD platform).",
        "Designed server and client side that support: Angular2+, mocks, authentication, authorization, and unit tests. ",
        "Application designed to be deployed on a container environments."
      ]
    },
    {
      "title": "Software Engineer",
      "company": "DST Systems",
      "startDate": "June 2015",
      "endDate": "January 2017",
      "description": "DevOps",
      "bullets": [
        "Retained support of products from prior position, while gaining management of servers and deployments.",
        "Developed multiple new application, include the companies first micro-serviced environments.",
        "Created cli project generators for Springboot and AngularJs (similar to angular2 cli)."
      ]
    },
    {
      "title": "Senior Software Developer",
      "company": "DST Systems",
      "startDate": "June 2013",
      "endDate": "June 2015",
      "description": "DevOps and support",
      "bullets": [
        "Sole web support person for up to 7 application at one time.",
        "Managed and resolved security vulnerabilities accross all my applications.",
        "Lead architecture and development on a flex to ExtJs rewrite."
      ]
    },
    {
      "title": "Staff Software Developer",
      "company": "DST Systems",
      "startDate": "June 2011",
      "endDate": "June 2013",
      "description": "Client mainframe and web support",
      "bullets": [
        "Developed and Lead ticket assignment system for a pooled client support team (domestic and abroad).",
        "Subject Matter Expert on client integrated web applications.",
        "Supporting maintenance for multiple clients at once."
      ]
    },
    {
      "title": "Software Developer",
      "company": "DST Systems",
      "startDate": "June 2008",
      "endDate": "June 2011",
      "description": "Client mainframe support.",
      "bullets": [
        "Designed and managed oversea development teams for new processes.",
        "Managed and converted file transfers for 3 successful client conversions."
      ]
    }
  ]
}
